///**
// * 7 segment
// */
// 
////총 10개의 숫자, 7 세그먼트
//byte digits[10][7] = {
////{a, b, c, d, e, f, g}
//  {0, 0, 0, 0, 0, 0, 1}, //0
//  {1, 0, 0, 1, 1, 1, 1}, //1
//  {0, 0, 1, 0, 0, 1, 0}, //2
//  {0, 0, 0, 0, 1, 1, 0}, //3
//  {1, 0, 0, 1, 1, 0, 0}, //4
//  {0, 1, 0, 0, 1, 0, 0}, //5
//  {0, 1, 0, 0, 0, 0, 0}, //6
//  {0, 0, 0, 1, 1, 1, 1}, //7
//  {0, 0, 0, 0, 0, 0, 0}, //8
//  {0, 0, 0, 1, 1, 0, 0} //9  
//};
//
//void setup() {
//  for(int i = 2; i < 10; i++){
//    pinMode(i, OUTPUT);
//  }
//  digitalWrite(9, HIGH); //DP는 찍을 필요가 없기에 아예 고정
//}
//
//void loop() {
//  //반복하면서 0부터 9까지 찍기
//  for(int i = 0; i < 10; i++){
//    display(i);
//    delay(1000);
//  }
//}
//
//void display(int num){ //num은 굳이 따지면 행을 입력받은거
//  int pin = 2; //회로에서 핀은 2번(A)부터 시작
//
//  for(int i = 0; i < 7; i++){
//    digitalWrite(pin + i, digits[num][i]);
//  }
//}
